Revit 2024 API
Frame Constructor (XYZ, XYZ, XYZ, XYZ)
 Constructor that takes the frame's base point and three basis vectors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Frame(
	XYZ origin,
	XYZ vec1,
	XYZ vec2,
	XYZ vec3
)
Visual Basic
Public Sub New ( _
	origin As XYZ, _
	vec1 As XYZ, _
	vec2 As XYZ, _
	vec3 As XYZ _
)
Visual C++
public:
Frame(
	XYZ^ origin,
	XYZ^ vec1,
	XYZ^ vec2,
	XYZ^ vec3
)
Parameters
origin
Type: Autodesk.Revit.DB.XYZ
 The frame's base point.
vec1
Type: Autodesk.Revit.DB.XYZ
 The frame's first basis vector.
vec2
Type: Autodesk.Revit.DB.XYZ
 The frame's second basis vector.
vec3
Type: Autodesk.Revit.DB.XYZ
 The frame's third basis vector.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Frame Class
Frame Overload
Autodesk.Revit.DB Namespace